from typing import Any

import pandas as pd
import pytest


@pytest.fixture
def data_list() -> Any:
    data = {
        "date": [
            "30.12.2021 22:22:03",
            "25.12.2021 03:04:15",
            "24.12.2021 18:18:27",
            "23.12.2021 17:00:31",
            "23.12.2021 16:14:59",
            "22.12.2021 21:41:00",
            "21.12.2021 12:39:50",
            "19.12.2021 20:13:13",
            "17.12.2021 23:47:40",
            "14.12.2021 17:14:44",
            "11.12.2021 15:47:40",
            "06.12.2021 16:22:13",
            "29.11.2021 18:09:38",
        ],
        "date_payment": [
            "31.12.2021",
            "25.12.2021",
            "24.12.2021",
            "23.12.2021",
            "23.12.2021",
            "23.12.2021",
            "21.12.2021",
            "20.12.2021",
            "17.12.2021",
            "14.12.2021",
            "11.12.2021",
            "06.12.2021",
            "29.11.2021",
        ],
        "card_num": ["", "*7197", "*7197", "*7197", "", "*5091", "", "*5091", "", "*7197", "*7197", "*7197", ""],
        "sum": [
            -20000.0,
            -3400.0,
            -34.0,
            -201.0,
            -10000.0,
            -50.0,
            -1198.23,
            -42.92,
            -232.96,
            -95.0,
            -123.54,
            -179.77,
            1100.0,
        ],
        "cashback": [0, 0, 0, 5, 0, 0, 0, 0, 8, 0, 0, 0, 0],
        "category": [
            "Переводы",
            "Развлечения",
            "Фастфуд",
            "Канцтовары",
            "Переводы",
            "Каршеринг",
            "Переводы",
            "Каршеринг",
            "Услуги банка",
            "Фастфуд",
            "Фастфуд",
            "Супермаркеты",
            "Пополнения",
        ],
        "descript": [
            "Константин Л.",
            "sevs.eduerp.ru",
            "Rumyanyj Khleb",
            "IP Mitrankov M V",
            "Светлана Т.",
            "Ситидрайв",
            "Перевод Кредитная карта. ТП 10.2 RUR",
            "Ситидрайв",
            "Плата за Программу страховой защиты",
            "IP Nelikaev +7 911 198-78-58",
            "Impulse coffee",
            "Дикси",
            "Перевод с карты",
        ],
        "bonus": [0.0, 68.0, 0.0, 4.0, 0.0, 2.0, 0.0, 2.0, 0.0, 1.0, 2.0, 3.0, 0.0],
    }
    df = pd.DataFrame(data)
    df["date"] = pd.to_datetime(df["date"], format="%d.%m.%Y %H:%M:%S")
    return df


@pytest.fixture
def data_list_empty() -> Any:
    d = {}
    df_1 = pd.DataFrame(d)
    return df_1
